nxp-appcodehub/dm-mcxn-portable-anomaly-detect-demo/dm-mcxn-portable-anomaly-detect/board/pin_mux.c
    /* PORT4_1 (pin P2) is configured as FC2_P1 */
    PORT_SetPinMux(PORT4, 1U, kPORT_MuxAlt2);

    PORT4->PCR[1] = ((PORT4->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT4_6 (pin N7) is configured as PIO4_6 */
    PORT_SetPinMux(PORT4, 6U, kPORT_MuxAlt0);

    PORT4->PCR[6] = ((PORT4->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_IBE_MASK)))

                     /* Pull Select: Enables internal pulldown resistor. */
                     | PORT_PCR_PS(PCR_PS_ps0)

                     /* Pull Enable: Enables. */
                     | PORT_PCR_PE(PCR_PE_pe1)

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
}

//Initialize pins for Relay and Fan.
void BOARD_Init_MotorPins(void)
{
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);

    /* Enables the clock for GPIO0: Enables clock */
	CLOCK_EnableClock(kCLOCK_Gpio3);

    gpio_pin_config_t gpio3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };

    GPIO_PinInit(GPIO3, 19U, &gpio3_config);  /* Output configuration */
    GPIO_PinInit(GPIO3, 23U, &gpio3_config);  /* Output configuration */

    //Added PIO configuration for PWM on Mikroe Native slot
    const port_pin_config_t port3_19_pinK17_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as PWM1_X1 */
                                                    kPORT_MuxAlt5,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT3_19 (pin K17) is configured as PWM1_X1 */
    PORT_SetPinConfig(PORT3, 19U, &port3_19_pinK17_config);

	// Added P3_23 --- Used as CS on mikroe native slot.
	const port_pin_config_t port3_23_config = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as PIO3_23 */
													kPORT_MuxAlt0,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
	/* PORT3_23 is configured as PIO3_23 */
	PORT_SetPinConfig(PORT3, 23U, &port3_23_config);

}

//Initialize RST pin connected to the MIKROE Slot.
void BOARD_Init_RST_ME(void)
{
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

    /* Enables the clock for GPIO1: Enables clock */
	CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t gpio1_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };

    GPIO_PinInit(GPIO1, 3U, &gpio1_3_config);  /* Output configuration */

    //Added PIO configuration for RST on Mikroe Native slot
    const port_pin_config_t port1_3_config = {/* Internal pull-up/down resistor is disabled */
    											kPORT_PullDisable,
												/* Low internal pull resistor value is selected. */
												kPORT_LowPullResistor,
												/* Fast slew rate is configured */
												kPORT_FastSlewRate,
												/* Passive input filter is disabled */
												kPORT_PassiveFilterDisable,
												/* Open drain output is disabled */
												kPORT_OpenDrainDisable,
												/* Low drive strength is configured */
												kPORT_LowDriveStrength,
												/* Pin is configured as PIO1_3 */
												kPORT_MuxAlt0,
												/* Digital input enabled */
												kPORT_InputBufferEnable,
												/* Digital input is not inverted */
												kPORT_InputNormal,
												/* Pin Control Register fields [15:0] are not locked */
												kPORT_UnlockRegister};
    /* PORT1_3 is configured as GPIO Output */
    PORT_SetPinConfig(PORT1, 3U, &port1_3_config);

}

/* Re-Initialize the PIN 3_19 as GPIO again to make sure it is held down during
   test sequence */
void BOARD_PWMpin_as_GPIO(void)
{
    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);

    /* Enables the clock for GPIO0: Enables clock */
	CLOCK_EnableClock(kCLOCK_Gpio3);

    gpio_pin_config_t gpio3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };

